snlkuharlocal/src/Documents/ЗаданиеНаАгрегацию/ЗаданиеНаАгрегацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаАгрегацию</name>
  <attributes>
    <name>ТипКороба</name>
    <type>
      <types>CatalogRef.ТипыКоробов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистыСозданы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегацииЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНоменклатурыСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольнаяКоробка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СодержимоеБлочка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БлочкиВсего</name>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ЗаданиеНаАгрегацию/Forms/ФормаЗНАпоНакладной/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)         
	Накладная = Параметры.ДанныеЗаполнения.Накладная;
	
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(ПланФакт, 		"Ссылка", Накладная);
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(ПланФактКомплектующие, 		"Ссылка", Накладная);
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(СписокЗНА, 		"Ссылка", Накладная);
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(СписокЛистовПереукладки, 		"Ссылка", Накладная);
	УправлениеВидимостью();
	РассчитатьИтоги();
КонецПроцедуры


&НаСервере
Процедура УправлениеВидимостью()   
	
	если ЗначениеЗаполнено(Накладная) тогда
		КМП = ПолучитьРеквизитШапки(Накладная,"ОтгрузкаКомплектов");
		если КМП тогда
			Элементы.ПланФакт.Видимость = ложь;
		иначе        
			Элементы.ПланФактКомплектующие.Видимость = ложь;
		КонецЕсли;                
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура СписокЗНАВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущаяСтрока = Элементы.СписокЗНА.ТекущиеДанные;   
	ОткрытьЗначение(ТекущаяСтрока.ЗаданиеНаАгрегацию);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛистовПереукладкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущаяСтрока = Элементы.СписокЛистовПереукладки.ТекущиеДанные;   
	ОткрытьЗначение(ТекущаяСтрока.ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры          

&НаКлиенте
Процедура ПерезаполнитьНумерациюКоробов(Команда)
	ПерезаполнитьНумерациюКоробовНаСервере(Накладная);
	элементы.СписокЛистовПереукладки.Обновить();
	Сообщить("Готово");
КонецПроцедуры       



&НаСервереБезКонтекста
Процедура ПерезаполнитьНумерациюКоробовНаСервере(Накладная)
	Документы.ЛистПереукладки.ПереномероватьВсеКоробкиНакладной(Накладная);	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВернутьЛистВРаботуНаСервере(Лист)
	Документы.ЛистПереукладки.ВернутьЛистОтЗНАВРаботу(Лист);
КонецПроцедуры

&НаКлиенте
Процедура ВернутьЛистВРаботу(Команда) 
	ТекущаяСтрока = Элементы.СписокЛистовПереукладки.ТекущиеДанные;    
	если ТекущаяСтрока<>Неопределено тогда
		ВернутьЛистВРаботуНаСервере(ТекущаяСтрока.Ссылка);
		элементы.СписокЛистовПереукладки.Обновить();         
	КонецЕсли;
КонецПроцедуры




&НаСервере
Процедура РассчитатьИтоги() 
	
	
	Схема = Элементы.СписокЗНА.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.СписокЗНА.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ЭтаФорма.Элементы.СписокЗНАЗаявка.ТекстПодвала =  Формат(Результат.Итог("Заявка"));        
	ЭтаФорма.Элементы.СписокЗНАВРаботеНаТСД.ТекстПодвала =  Формат(Результат.Итог("ВРаботеНаТСД"));
	ЭтаФорма.Элементы.СписокЗНАСобрано.ТекстПодвала =  Формат(Результат.Итог("Собрано"));         
	
	
	
	
	
	
	
	КМП = ПолучитьРеквизитШапки(Накладная,"ОтгрузкаКомплектов");
	если КМП тогда
		Схема = Элементы.ПланФактКомплектующие.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
		Настройки = Элементы.ПланФактКомплектующие.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		ЭтаФорма.Элементы.ПланФактКомплектующиеЗаявка.ТекстПодвала =  Формат(Результат.Итог("Заявка"));        
		ЭтаФорма.Элементы.ПланФактКомплектующиеВРаботеНаТСД.ТекстПодвала =  Формат(Результат.Итог("ВРаботеНаТСД"));
		ЭтаФорма.Элементы.ПланФактКомплектующиеСобрано.ТекстПодвала =  Формат(Результат.Итог("Собрано"));    
	иначе   
		Схема = Элементы.ПланФакт.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
		Настройки = Элементы.ПланФакт.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		ЭтаФорма.Элементы.ПланФактЗаявка.ТекстПодвала =  Формат(Результат.Итог("Заявка"));        
		ЭтаФорма.Элементы.ПланФактВРаботеНаТСД.ТекстПодвала =  Формат(Результат.Итог("ВРаботеНаТСД"));
		ЭтаФорма.Элементы.ПланФактСобрано.ТекстПодвала =  Формат(Результат.Итог("Собрано"));    			
	КонецЕсли; 	
	
КонецПроцедуры



&НаСервере
Функция ЗаполнитьЛистыПереукладкиНаСервере()  
	СтруктураВозврата = новый Структура("Успех,Ошибки",ложь,новый Массив);
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	ЗаданиеНаАгрегацию.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаданиеНаАгрегацию КАК ЗаданиеНаАгрегацию
	|ГДЕ
	|	ЗаданиеНаАгрегацию.Проведен
	|	И ЗаданиеНаАгрегацию.ДокОснование = &ДокОснование
	|	И НЕ ЗаданиеНаАгрегацию.АгрегацииЗаполнены";
	запрос.УстановитьПараметр("ДокОснование",Накладная);
	Выборка = запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл   
		Результат = документы.ЗаданиеНаАгрегацию.ЗаполнитьЛистыПереукладкиПоЗНА(Выборка.Ссылка);
		если не Результат.Успех тогда      
			СтруктураВозврата.Ошибки.Добавить(""+Выборка.Ссылка);	
			МаркировкаКС.ДобавитьОшибки(СтруктураВозврата,Результат);
		иначе    
			ЗНАОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЗНАОбъект.АгрегацииЗаполнены = Истина;     
			ЗНАОбъект.ЛистыСозданы = Истина;
			ЗНАОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	если СтруктураВозврата.Ошибки.Количество() = 0 тогда
		СтруктураВозврата.Успех = Истина;
	КонецЕсли;                           
	возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЛистыПереукладки(Команда) 
	если не ЗначениеЗаполнено(Накладная) тогда
		Возврат;
	КонецЕсли;
	
	Результат = ЗаполнитьЛистыПереукладкиНаСервере();
	если не Результат.Успех тогда
		Сообщить(СтрСоединить(Результат.Ошибки,символы.ПС));
	КонецЕсли;
	элементы.СписокЗНА.Обновить();
	
КонецПроцедуры    

&НаСервере
Функция СформироватьQRНаСервере(ЗНА) 
	
	ОбработкаФормированияКартинки = Обработки.СформироватьКартинкуКодаШКQR.Создать();
	Эталон = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьМакет("Эталон");
	ММвВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	
	Схема = Элементы.СписокЗНА.ПолучитьИсполняемуюСхемуКомпоновкиДанных();	
	Настройки = Элементы.СписокЗНА.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Если Результат.Количество() = 0 Тогда
		Возврат Новый ТабличныйДокумент;
	Иначе 
		ЗНА = Результат.Получить(0).ЗаданиеНаАгрегацию;
	КонецЕсли;

	ТД = Новый ТабличныйДокумент;
	ТД.ИмяПараметровПечати = "ПечатьЗНА";
	
	СтруктураДанныхКомпонентыПечати = ОбработкаФормированияКартинки.ПолучитьКомпонентуФормированияDataMatrixКода();	
	
	//СформироватьQRНаСервере(); 
	
	Макет = Документы.ЗаданиеНаАгрегацию.ПолучитьМакет("Макет");
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	
	ЗаполнитьЗначенияСвойств(ОблШапка.Параметры, ЗНА);
	
	ТД.Вывести(ОблШапка);
	
	ОблЭтикетка = Макет.ПолучитьОбласть("Строка");      

	// Кельманов А.В. - Исправление ошибки - 2025.11.07 {
	//ЗаполнитьЗначенияСвойств(ОблЭтикетка.Параметры,ЗНА);
	// Кельманов А.В. - Исправление ошибки - 2025.11.07 }
	
	Счетчик = 0; // Кельманов А.В. - SNL-207 - 2026.04.22
	
	Для Каждого Строка Из Результат Цикл
		
		ЗНА = Строка.ЗаданиеНаАгрегацию;
		
		// Кельманов А.В. - Исправление ошибки - 2025.11.07 {
		ЗаполнитьЗначенияСвойств(ОблЭтикетка.Параметры, ЗНА);
		// Кельманов А.В. - Исправление ошибки - 2025.11.07 }
		
		Строка = ЗначениеВСтрокуВнутр(ЗНА);     
		Строка = стрзаменить(Строка, "¶", "");
		Строка = стрзаменить(Строка, Символы.ПС, "");
		
		МассСтрок = Новый Массив;
		
		Для Каждого СтрТЧ Из ЗНА.Товары цикл
			МассСтрок.Добавить("" + СтрТЧ.Номенклатура + " - " + Строка(СтрТЧ.Количество));
		КонецЦикла;
		
		ОблЭтикетка.Параметры.ТаблицаНоменклатуры = СтрСоединить(МассСтрок, Символы.ПС);
		
		Рисунок = ОблЭтикетка.Рисунки.QRКод; 		
		ДопПараметры = Новый Структура;	
		КартинкаКода = ОбработкаФормированияКартинки.СформироватьКартинкуШК_DataMatrix(СтруктураДанныхКомпонентыПечати, Строка, ДопПараметры);  
		Рисунок.Картинка = КартинкаКода;        

		ТД.Вывести(ОблЭтикетка);
		
		// Кельманов А.В. - SNL-207 - 2026.04.22 {
		Счетчик = Счетчик + 1;
		
		Если Счетчик % 2 = 0 Тогда
			
			ТД.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		// Кельманов А.В. - SNL-207 - 2026.04.22 }
		
	КонецЦикла;
	
	Возврат ТД;
	
КонецФункции

&НаКлиенте
Процедура СформироватьQR(Команда) 
		
	ТекущаяСтрока = Элементы.СписокЗНА.ТекущиеДанные;   
	ПравилаЧЗ = ПолучитьРеквизитыШапки(ТекущаяСтрока.ЗаданиеНаАгрегацию,"ДокОснование.ПравилаАгрегацииЧестногоЗнака.ТребуетсяАгрегацияБлочков,ДокОснование.ПравилаАгрегацииЧестногоЗнака.ТребуетсяАгрегацияКоробок");
	
	// Кельманов А.В. - Оптимизация работы - 2025.11.07 {
	//Если ПравилаЧЗ.ДокОснование_ПравилаАгрегацииЧестногоЗнака_ТребуетсяАгрегацияБлочков = Истина тогда     
	//	Сообщить("Работа с блочками пока не реализована");
	//	Возврат;
	//КонецЕсли; 
	// Кельманов А.В. - Оптимизация работы - 2025.11.07 }
	
	Если не ПравилаЧЗ.ДокОснование_ПравилаАгрегацииЧестногоЗнака_ТребуетсяАгрегацияКоробок = Истина тогда     
		Сообщить("В правилах агрегации нет коробок");
		Возврат;
	КонецЕсли; 
	
	
	если ТекущаяСтрока<>Неопределено тогда
		ТД = СформироватьQRНаСервере(ТекущаяСтрока.ЗаданиеНаАгрегацию);	  
		ТД.показать();        
	КонецЕсли;
	
	
КонецПроцедуры
